{
    "core":{
        "title": "Health Academy (Front-End)",
        "desc": "Taiwan International Medical Education"
    },
    "info":{
        "item1": "Joint Commission of Taiwan",
        "item2": "UI / UX Designer",
        "item3": "UI Design, UX Research, Design System, Prototype"
    },
    "demand": {
        "item1": "Web Design",
        "item2": "Registration Review System",
        "item3": "Course Page",
        "item4": "Course Enrollment & Review System",
        "item5": "Member Center",
        "item6": "Online Chat Consultation"
    },
    "team":{
        "item1": "UI / UX Designer",
        "item2": "Front-end Developer",
        "item3": "Back-end Developer",
        "item4": "Project Manager",
        "item5": "System Analysis"
    },
    "brief":{
        "item1": "The MOHW has commissioned the Joint Commission of Taiwan to establish the Overseas Medical Personnel Training Platform. This platform is designed to provide a comprehensive overview of Taiwan's medical and health training courses and achievements for foreign medical professionals. It also offers more complete training information and application services through the platform.",
       "item2": "Integrating Existing Resources and Achievements",
        "item2-1": "The platform will consolidate various medical and healthcare training programs offered by Taiwan for overseas healthcare personnel. These programs cover a wide range of topics, including clinical skills, professional techniques, and healthcare management.",
        "item3": "Providing Information and Application Services",
        "item3-1": "The platform will offer comprehensive course search, application guidance, and trainee management features. This will enable overseas healthcare professionals to quickly identify suitable training programs and apply for participation with ease.",
        "item4": "Enhancing International Medical Collaboration",
        "item4-1": "Taiwan aims to establish closer collaborations with other countries, facilitating the exchange of knowledge and technology while further enhancing its global reputation in healthcare."
    },
    "briefCard":{
        "item1": "Summarize various medical and healthcare training courses offered in our country, provide online registration for overseas medical personnel, and facilitate the qualification application review process through our Ministry of Health and Welfare.",
        "item2": "In this project, I worked closely with the PM, SA, and four engineers. I was responsible for the entire UX and UI design process and deliverables, from defining the problem to delivering the final visual design to the engineers.",
        "item3": "This project has a large and complex structure, encompassing features such as a backend system, multilingual switching, and online chat. Additionally, the course registration and review functionalities have more restrictions compared to other industries.",
        "item4": "We complete each goal in stages to ensure the overall website and its features operate smoothly, and we improve various functions based on feedback from healthcare institution users."
    },
    "background":{
        "item1": "Medical services worldwide are increasingly emphasizing international cooperation, especially in areas such as cross-border medical aid and healthcare infrastructure development. The professional competence of healthcare personnel has become a crucial foundation for advancing collaboration. The professional training provided by the platform will help enhance the overall quality of healthcare personnel globally."
    },
    "problem": {
        "item1": "Integrate course resources from national medical institutions",
        "item2": "Provide multi-language switch for the website",
        "item3": "Categorize courses into clinical courses, non-clinical courses, demonstration courses, and other filters",
        "item4": "Provide individual and group registration functions for courses",
        "item5": "Allow participants to view the registration review results",
        "item6": "Allowing students to consult online with the course provider"
    },
    "research": { 
        "item1": "How to integrate the resources of medical institutions across Taiwan and provide multi-language support on the website for overseas medical personnel?", 
        "item2": "How to build a course registration system that supports both individual and group registrations, and includes an approval function?" 
    },
    "sa": { 
        "item1": "Understand the MOHW's review standards for medical course registrations", 
        "item2": "Collect and categorize courses from various medical training providers to establish a unified classification", 
        "item3": "Understand the operational habits of medical personnel through interviews and surveys", 
        "item4": "Understand the needs of course providers regarding course information presentation", 
        "item5": "Refer to the operational models of existing course registration systems" 
    },
    "ta": { 
        "item1": "Students in overseas medical-related disciplines", 
        "item1-1": "Learners in related fields interested in overseas medical education.", 
        "item2": "Medical personnel in overseas medical institutions", 
        "item2-1": "Personnel employed in overseas medical institutions who have a need for further training."
    },
    "hypo": { 
        "item1": "Students in overseas medical-related disciplines", 
        "item1-1": "Learners in related fields interested in overseas medical education.", 
        "item2": "Medical personnel in overseas medical institutions", 
        "item2-1": "Personnel employed in overseas medical institutions who have a need for further training."
    }

    
}