{
    "core":{
        "title": "Locus Cell CO., LTD.",
        "desc": "Creating a tech-savvy service experience"
    },
    "info":{
        "item1": "Locus Cell CO., LTD.",
        "item2": "UI / UX Designer",
        "item3": "UI Design, UX Research, Design System, Prototype"
    },
    "demand": {
        "item1": "Web Visual Design",
        "item2": "Multilingual Web Pages",
        "item3": "Page Data Presentation",
        "item4": "Form Design"
    },
    "team":{
        "item1": "UI / UX Designer",
        "item2": "Front-end Developer",
        "item3": "Back-end Developer",
        "item4": "Project Manager",
        "item5": "System Analysis"
    },
    "brief": {
        "item1": "Locus Cell CO., Ltd., entrusted us to redesign their business website, aiming to deliver a visual design experience that better reflects the company’s current identity.",
        "item2": "Technology-inspired visual design",
        "item2-1": "As a biotechnology company, they desired a design style that embodies a sense of technology and simplicity.",
        "item3": "Colors full of vitality",
        "item3-1": "The company aims to showcase a natural and bio-tech-integrated aesthetic, creating a visual impression of health, vitality, and hope.",
        "item4": "Clear and concise layout",
        "item4-1": "The website includes extensive company information, which we categorized and presented clearly to provide users with a seamless experience."
    },
    "briefCard": {
        "item1": "Redesigned the business official website to align with the current company image, ensuring a visually appealing presentation across multilingual pages.",
        "item2": "In this project, I closely collaborated with the PM and two engineers. I was responsible for the entire UX and UI design process and deliverables, defining the visual system and screen layouts.",
        "item3": "The company had numerous data-intensive pages requiring clear information presentation while maintaining structural hierarchy. This involved collaborating with backend engineers to design pages editable via the backend.",
        "item4": "We successfully delivered a website that better aligns with the corporate image and clearly showcases the company's data."
    },
    "background": {
        "item1": "Locus Cell CO., Ltd., in line with its corporate development, aims to present a visual identity that better reflects the company and establishes a corporate image befitting a biotechnology company."
    },
    "goal": {
        "item1": "Redesign the website interface",
        "item2": "Provide multilingual switching for the website",
        "item3": "Present data clearly"
    },
    "problem": {
        "item1": "Limited resources provided by the company",
        "item2": "Some data was previously presented as static images",
        "item3": "The displayed data includes many different categories"
    },
    "sa": { 
        "item1": "Refer to popular biotech company websites in the market", 
        "item2": "Understand the image the company wants to present", 
        "item3": "Check the amount and level of data provided by the company"
    },
    "ta": { 
        "item1": "Partners interested in the company's technology", 
        "item1-1": "Potential collaborators for future opportunities"
    },
    "principle": {
        "item1": "Clear and Intuitive Interface",
        "item1-1": "Provide a clear navigation bar to help users quickly find the content they need. Sub-items are available for direct selection in the presented information sections.",
        "item2": "Biotech-Inspired Visual Representation",
        "item2-1": "Use irregular and circular shapes to mimic the appearance of cells, reflecting biotechnology elements.",
        "item3": "Clear Information Architecture",
        "item3-1": "Categorize information blocks by hierarchy and use different layouts to present subcategories.",
        "item4": "Vibrant Colors",
        "item4-1": "Choose a green color palette to convey a fresh and comfortable visual experience, evoking vitality."
    },
    "system": { 
        "item1": "In this project, we adopted <strong>Figma</strong> to build and manage the design system, enabling a consistent and efficient component development process. The design system includes commonly used UI components such as buttons, forms, cards, and navigation bars. It is organized modularly for reusability and scalability. Our design system has the following features:",
        "item2": "Consistent Design Specifications", 
        "item2-1": "Design systems provide unified style guides and design specifications to ensure consistency in the appearance of components across different pages and modules.", 
        "item3": "Presentation in Different Sizes", 
        "item3-1": "Developers can compare the style of components displayed at various sizes.", 
        "item4": "Component State Presentation", 
        "item4-1": "Developers can compare the style of components displayed in different states."
    },
    "mockup": { 
        "tab": {
            "item1": "Home",
            "item2": "News",
            "item3": "Our Teams",
            "item4": "Investor Area",
            "item5": "Declaration Form"
        },
        "info": {
            "item1": "Navigation Bar",
            "item1-1": "Displays submenus and allows language switching.",
            "item2": "Irregular Shaped Images",
            "item2-1": "Uses irregular shaped images to convey a biotech feel.",
            "item3": "Latest News Section",
            "item3-1": "Presented in a list format with category labels.",
            "item4": "Photo Display",
            "item4-1": "Uses a photo as a background, displaying job titles and personal information on top.",
            "item5": "Toggle Button",
            "item5-1": "Fixes the main category toggle button to the left, maintaining a consistent design and clear categorization.",
            "item6": "Subcategory Toggle Button",
            "item6-1": "Displays smaller levels on the right with toggle buttons to avoid information overload.",
            "item7": "Unified Components",
            "item7-1": "Uses unified components with variations applied across different pages.",
            "item8": "Component Variants",
            "item8-1": "Displays different information based on various contexts.",
            "item9": "Form Display",
            "item9-1": "Uses consistent input fields or options to present a clean design."
        }
    },
    "handoff": { 
        "item1": "In <strong>Figma</strong>, I demonstrated various breakpoints for RWD screens and the visual effects on different devices to ensure the design provides a good experience across different screen sizes."
    },
    "feedback": {
        "item1": "Mastery of Design Style",
        "item1-1": "The client this time wanted to present the characteristics of the biotech field and showcase the company’s image. I gathered a large amount of information online and referenced the designs of other competitors, learning about the currently popular design styles. This allowed the client to have a satisfying experience with this collaboration.",
        "item2": "Presentation of Information",
        "item2-1": "The original website required a large amount of company information to be displayed. Adhering to the principle of consistency helps keep the layout clear and organized, while still leaving flexibility on the page for future expansion."
        }
    
}