{
    "core":{
        "title": "Taichung long-term care transfer APP",
        "desc": "Providing citizens with the most convenient long-term care transportation service"
    },
    "info":{
        "item1": "Health Bureau of Taichung City Government",
        "item2": "UI / UX Designer",
        "item3": "UI Design, UX Research, Design System, Prototype"
    },
    "demand": {
        "item1": "New APP Features",
        "item2": "Long-term Care Community Shuttle System",
        "item3": "Public & Driver Version Design",
        "item4": "Public Ride-Hailing Service Reservation",
        "item5": "Public Member Center",
        "item6": "Historical Trips",
        "item7": "Driver Task List",
        "item8": "Driver Clock-In System"
    },
    "team":{
        "item1": "UI / UX Designer",
        "item2": "Front-end Developer",
        "item3": "Back-end Developer",
        "item4": "Project Manager",
        "item5": "System Analysis",
        "item6": "Android App Developer"
    },
    "brief": {
        "item1": "Our company was commissioned by the Taichung City Government to add new features to the existing system, providing citizens with a 'Community Shuttle' service to meet the needs of elderly residents traveling between their homes and long-term care centers.",
        "item2": "Services for the Elderly",
        "item2-1": "Elderly users can use the app to schedule shuttle services in advance, facilitating convenient travel between their homes and long-term care centers.",
        "item3": "Customized Service Options",
        "item3-1": "Since the primary users are elderly individuals, their specific needs must be considered, offering convenient service options tailored to them.",
        "item4": "Driver version",
        "item4-1": "The app also includes a driver version, enabling drivers to receive bookings and perform various actions during trips (e.g., check-in upon boarding, marking arrival at destinations, etc.)."
    },
    "briefCard": {
        "item1": "Expanded the original app with new features to meet the needs of elderly users traveling between their homes and long-term care centers, as well as providing a version for drivers.",
        "item2": "In this project, I closely collaborated with the PM and engineers. I was responsible for the entire UX and UI design process and deliverables, from defining the problem to delivering the final visual design to the engineers.",
        "item3": "This project involved adding features to the existing system, requiring designs to align with the original style and user workflows, which imposed additional constraints on the design process.",
        "item4": "We completed the functionality in phases, ensuring a smooth user experience for both users and drivers. We also improved various features based on user feedback and planned to introduce group booking services in the future."
    },
    "background": {
        "item1": "The government is promoting the 'Long-Term Care 2.0 Plan,' which provides diverse care resources through an integrated service model, including home-based, community-based, and institutional care. For many elderly individuals or those with limited mobility, transportation to medical facilities, rehabilitation centers, or day care units remains a significant challenge. This project not only effectively integrates transportation resources but also offers real-time booking, customized services, and care safety features, providing convenient and reliable transportation services for families and the elderly."
    },
    "goal": {
        "item1": "Add community shuttle service feature",
        "item2": "Allow users to book shuttle services via the app",
        "item3": "Provide users with customized options",
        "item4": "Enable drivers to offer shuttle services",
        "item5": "Provide real-time updates for drivers"
    },
    "problem": {
        "item1": "New features need to be added to the original system, but the original design files have been lost.",
        "item2": "The original system does not include a navigation bar, making it difficult for users to return to the 'Home' page.",
        "item3": "Consideration must be given to the usage habits of older adults.",
        "item4": "To meet the needs of older adults, more information needs to be displayed while also addressing the display limitations of mobile screens."
    },
    "sa": { 
        "item1": "Understand the government's regulations on long-term care subsidies", 
        "item2": "Understand the usage habits of elderly users",
        "item3": "Categorize the types of reservation forms",
        "item4": "Understand the stages and items to be confirmed during the transportation process"
    },
    "ta": { 
        "item1": "Elderly individuals requiring transportation to and from long-term care centers", 
        "item1-1": "Elderly individuals needing to use reservation-based transport services to travel between long-term care centers and their homes.", 
        "item2": "Drivers utilizing the transportation system", 
        "item2-1": "Drivers who use the system to confirm reservations and are responsible for transporting clients."
    },
    "research": {
        "item1": "How to provide an easy-to-use appointment system for the elderly?",
        "item2": "How to provide a clear appointment form presentation for drivers?",
        "item3": "How to help drivers complete each stage of the task?",
        "item4": "How to view historical appointment forms?"
    },
    "hypo": { 
        "item1": "Provide an interface friendly to elderly users",
        "item1-1": "Considering the needs of elderly users, we enlarged the font size and spacing.",
        "item2": "Clear information presentation",
        "item2-1": "We maintain a consistent format for the forms to enhance readability.",
        "item3": "Driver status confirmation",
        "item3-1": "We provide time predictions and dynamic tracking of the driver on the booking form.",
        "item4": "Driver dynamics",
        "item4-1": "The driver must click to complete the current task; the next task cannot be clicked until the previous one is completed."
    },
    "challenge": { 
        "item1": "Layout Planning",
        "item1-1": "Increasing the font size and spacing can make the layout information more complex.",
        "item2": "Driver Scheduling",
        "item2-1": "A driver may have multiple bookings, and the status of each booking must be clearly distinguished.",
        "item3": "Driver Task Operations",
        "item3-1": "The driver may forget to click to complete the task."
    },
    "principle": { 
        "item1": "Consistency",
        "item1-1": "To continue the original design style, we use the same colors and layout.",
        "item2": "Ease of Use",
        "item2-1": "Considering the target audience is the elderly, we make the visual presentation as large as possible."
    },
    "system": { 
        "item1": "In this project, I used <strong>Figma</strong> to establish and manage the design system, enabling a consistent and efficient component development process. The design system covers commonly used UI components, including buttons, forms, cards, and more."
    },
    "mockup": { 
        "tab": {
            "item1": "Registration",
            "item2": "Home",
            "item3": "Search",
            "item4": "Course Categories",
            "item5": "Course Detail",
            "item6": "Course Enrollment",
            "item7": "Training Institute",
            "item8": "Apply Review Progress",
            "item9": "Online Consultation"
        },
        "info": {
            "item1": "Segmented Control",
            "item1-1": "Use dynamic switching to toggle between different forms, catering to different user registrations while maintaining a unified design and reducing additional development efforts.",
            "item2": "Real-time Validation",
            "item2-1": "Integrate API data to enable real-time validation, reducing manual review time.",
            "item3": "Search Function",
            "item3-1": "Place the search function in the Hero section of the homepage, allowing visitors to search for courses or providers instantly, enhancing convenience.",
            "item4": "Latest News Section",
            "item4-1": "Showcase the latest three news updates on the website.",
            "item5": "Popular Course Categories",
            "item5-1": "Categorize courses by type to help users quickly find suitable categories.",
            "item6": "Student Reviews",
            "item6-1": "Display the latest course reviews from students to provide visitors with feedback on the courses.",
            "item7": "Introduction to Taiwan's Features",
            "item7-1": "Since most visitors are international students, provide information about Taiwan (transportation, cuisine, attractions, etc.) to help them quickly understand the country.",
            "item8": "Modal popup",
            "item8-1": "With the use of popup design, users can check information at any time on the screen. We also provide popular tags and recommended courses for reference.",
            "item9": "Collapse Button", 
            "item9-1": "Click the Filter button on the left to collapse the filter, making it easier for users to browse.", 
            "item10": "Course Card", 
            "item10-1": "Courses are designed in card format, with key information displayed, allowing users to easily view required items in real time.",
            "item11": "Fixed Card", 
            "item11-1": "Fix the course information card on the right side, allowing users to click and register for the course anytime while browsing the information on the left.", 
            "item12": "Segmented Control", 
            "item12-1": "Users can instantly switch between information for easy and quick content search.",
            "item13": "Progress Bar", 
            "item13-1": "Displays the registration stage with a progress bar, dividing the steps to avoid a lengthy filling process.", 
            "item14": "Group Registration Section", 
            "item14-1": "Use the 'Add New' button to add members, and a file upload button is also provided to batch add members.",
            "item15": "Drawer Component", 
            "item15-1": "After clicking the 'Add New' button, the form will slide out from the right side, saving space on the page.",
            "item16": "Course Unit Card", 
            "item16-1": "Provides contact information and consultation button.", 
            "item17": "Segment Control", 
            "item17-1": "Users can instantly switch between information to browse the unit's introduction, courses, and transportation details.",
            "item18": "Segment Control",
            "item18-1": "Allows toggling to view courses with different registration statuses.",
            "item19": "Registered Course Card",
            "item19-1": "Presented in a card format, displaying various review statuses and action buttons.",
            "item20": "Registration Details", 
            "item20-1": "Click the registration course card to view the details.", 
            "item21": "Registration Form", 
            "item21-1": "This is a group registration demonstration, where you can check the registration review status of each member.",
            "item22": "Chat Window", 
            "item22-1": "Click the consultation button in the lower-right corner to expand the chat window. The units that have conducted the conversation will be listed for easy viewing.",
            "item23": "Real-time Chat", 
            "item23-1": "The chat window allows real-time communication with the course units and supports file uploads."
        }
    },
    "prototype": { 
        "item1": "Citizen Version",
        "item1-1": "After logging in, users can access the 'Community Transport' service from the homepage and switch features using the bottom navigation bar. At the top, there is a toggle button for transport services, where users can book rides, view reservations, and check their trip history.",
        "item2": "Book Transport Service",
        "item2-1": "After clicking 'Book a Ride,' users can choose the type of transport. They can prefill the form with frequently used addresses, select the appointment time, specify the number of companions, indicate wheelchair needs, and add remarks before submitting the reservation.",
        "item3": "View Reserved Trips",
        "item3-1": "Clicking 'Reserved Trips' allows users to view their scheduled transport services. They can track the driver's status and view detailed information or cancel reservations by clicking on the cards. In 'Trip History,' users can filter by date to view past reservation records.",
        "item4": "Driver Version",
        "item4-1": "After logging in, drivers can access the 'Community Transport' service from the homepage. A toggle button at the top allows them to perform pre-trip checks, view task lists, and review trip history. Drivers can clock in for work using the 'Settings' function and clock out after completing services. Clocking in and out multiple times in a day is supported.",
        "item5": "Complete Tasks",
        "item5-1": "In the 'Task List,' drivers can view their current assignments. The task card shows the status of each task in the upper right corner. During a task, drivers need to click 'Start' and proceed through each stage by pressing the corresponding buttons to complete the task. In case of any issues, they can click the 'Exception Button,' select a reason, and mark the task as completed."
    },
    "handoff": { 
        "item1": "In <strong>Figma</strong>, I designed different versions of the interface and provided screen annotations to help the development team understand the user operation logic.",
        "item2-1": "Public Version",
        "item2-2": "Driver Version"
    },
    "feedback": {
        "item1": "Expansion of New Features",
        "item1-1": "This project expanded on an existing one by introducing new features. Without the original design drafts, it was challenging to add new functionalities. I spent significant time recreating the old version and used it as a foundation to design the expanded features for this project, ensuring consistency in the design.",
        "item2": "Requirements for Different Versions",
        "item2-1": "The public and driver versions have completely different operational functionalities. The design needed to be adjusted based on the specific needs of these different user groups.",
        "item3": "Interface Design for Specific User Groups",
        "item3-1": "This project was primarily designed for older adults. By observing their usual habits and gathering user feedback, we adjusted the design to a more suitable presentation while also ensuring usability and convenience.",
        "item4": "Consideration of Various Scenarios",
        "item4-1": "In a booking and transport service, various unexpected situations may arise. It was necessary to account for all possibilities, provide options for predefined scenarios, and devise solutions for undefined situations."
    }
    
}