{
    "core":{
        "title": "Health Academy (Back-End)",
        "desc": "Taiwan International Medical Education"
    },
    "info":{
        "item1": "Joint Commission of Taiwan",
        "item2": "UI / UX Designer",
        "item3": "UI Design, UX Research, Design System, Prototype"
    },
    "demand": {
        "item1": "Web Design",
        "item2": "Registration Review System",
        "item3": "Course Page",
        "item4": "Course Enrollment & Review System",
        "item5": "Member Center",
        "item6": "Online Chat Consultation"
    },
    "team":{
        "item1": "UI / UX Designer",
        "item2": "Front-end Developer",
        "item3": "Back-end Developer",
        "item4": "Project Manager",
        "item5": "System Analysis"
    },
    "brief": {
        "item1": "The 'Overseas Healthcare Personnel Training Platform' aims to consolidate and showcase Taiwan's training programs and achievements for overseas healthcare professionals while optimizing application and management services. This enhances Taiwan's role in global health development. To support the platform's full operation and ensure a smooth user experience, a robust backend system was developed as the core technical foundation of the platform. The system includes the following key features:",
        "item2": "Efficient Data Integration",
        "item2-1": "The backend system integrates comprehensive information about training programs, including course content, schedules, trainer profiles, and past training outcomes. This enables centralized management and ensures up-to-date information.",
        "item3": "Streamlined Application Processes",
        "item3-1": "The system automates the application process, allowing overseas healthcare professionals to easily search for, register, and apply for training programs. Features include application status tracking, document submission, and automated notifications, significantly reducing administrative workload and improving application efficiency.",
        "item4": "Trainee and Program Management",
        "item4-1": "The backend allows administrators to monitor trainee progress, manage training records, and generate relevant outcome reports, enhancing management transparency and data-driven decision-making.",
        "item5": "Promoting Global Health Collaboration",
        "item5-1": "The system supports multilingual capabilities and customizable workflows to meet the diverse needs of users from different countries and regions, further strengthening international engagement and collaboration."
    },
    "briefCard": {
        "item1": "Developed a fully functional and user-friendly backend system to support the efficient operation of the 'Overseas Healthcare Personnel Training Platform.' The system integrates training course data, streamlines application processes, and provides trainee management features.",
        "item2": "As a UI/UX designer, I was responsible for designing the backend system's interface and user experience. This included user needs analysis, interface design, and establishing a design system. I worked closely with the development team to ensure the seamless implementation and continuous optimization of the design concepts.",
        "item3": "The project faced challenges in balancing diverse user needs with the complexity of the backend system, including designing an effective information architecture to manage large volumes of course and trainee data while supporting multilingual requirements. Additionally, resource and time constraints posed pressure on the design and development timeline, requiring constant adjustments and optimizations to meet deadlines.",
        "item4": "The completion of the backend system significantly improved administrative efficiency, simplified course and trainee management processes, and reduced workload through automation. The establishment of a design system also laid a solid foundation for future platform expansion and optimization, ensuring the long-term sustainability and value of the project."
    },
    "background":{
        "item1": "This backend system serves as the core technical foundation developed to support the Health Academy Platform. It aims to integrate training program information provided by Taiwan to international healthcare professionals, enhance overall management efficiency, and simplify operational processes. Through the backend system, administrators can easily access course details, track application progress, and manage trainee data. Additionally, it supports multilingual and multicultural requirements to foster international medical collaboration."
    },
    "problem": {
        "item1": "Improve backend management efficiency and simplify operational processes",
        "item2": "Frontend website content editing",
        "item3": "Support management of course content, application progress, and trainee data"
    },
    "sa": { 
        "item1": "Understand the data management needs of the frontend", 
        "item2": "Understand the needs of system administrators and define system functions and workflows", 
        "item3": "Design a clear data structure to ensure efficient integration of course information and trainee management", 
        "item4": "Evaluate the existing technical architecture and platform scalability to ensure system stability and security"
    },
    "ta": { 
        "item1": "Ministry of Health and Welfare Administrator", 
        "item1-1": "Has the highest authority over the platform system and manages all course provider data.", 
        "item2": "Course Provider Administrator",
        "item2-1": "Can edit course pages, review registered trainees, and edit the introduction pages on the platform."
    },
    "research": {
        "item1": "How might we design an intuitive backend interface to simplify complex operations for administrators?",
        "item2": "How might we create a systematic editing page?",
        "item3": "How might we automate administrative processes to reduce manual work and improve efficiency?",
        "item4": "How might we design a scalable backend system that facilitates future platform growth?"
    },
    "hypo": { 
        "item1": "Clear Navigation Structure",
        "item1-1": "Use a multi-level design to avoid overcrowding too many functions on the same page.",
        "item2": "Modular Design",
        "item2-1": "Design standardized templates for different editing pages to ensure consistency.",
        "item3": "Batch Processing",
        "item3-1": "Provide batch operation options, allowing administrators to process multiple items at once, reducing repetitive manual tasks.",
        "item4": "Real-Time Preview",
        "item4-1": "Allow administrators to view a preview during the editing process so they can instantly see the effects of changes.",
        "item5": "System Integration",
        "item5-1": "Integrate the backend management system with other systems to automatically update data or trigger necessary actions, reducing manual intervention."
    },
    "challenge": { 
        "item1": "Differentiated User Needs",
        "item1-1": "Different administrators have different work habits and requirements. Designing a universal interface may not fully meet each user's needs, especially in complex business processes.",
        "item2": "Technical Implementation Challenges",
        "item2-1": "Efficient, real-time preview features or drag-and-drop components require advanced frontend development skills, which may incur additional development costs and time, posing challenges for small teams or resource-limited companies."
    },
    "principle": { 
        "item1": "Simple and intuitive interface",
        "item1-1": "The navigation bar ensures that each functional area is clearly defined.",
        "item2": "Easy course creation and editing",
        "item2-1": "Provides an intuitive interface that allows administrators to easily add and edit course information, including course name, description, price, schedule, instructor, and course content.",
        "item3": "Course status management",
        "item3-1": "Allows administrators to set course statuses (e.g., published, unpublished, ongoing, completed) and provides automated reminders or notifications when a course is near full capacity or needs updating.",
        "item4": "Enrollment details and status tracking",
        "item4-1": "Administrators should be able to view detailed information for each enrollment (e.g., student details, enrollment time) and update enrollment statuses (e.g., pending, confirmed, canceled).",
        "item5": "Tiered permission control",
        "item5-1": "Set different levels of operation permissions based on roles (e.g., super administrator, course administrator) to prevent unauthorized personnel from modifying sensitive data."
    },
    "system": { 
        "item1": "In this project, we adopted <strong>Storybook</strong> to build and manage the design system, enabling a consistent and efficient component development process. The design system includes commonly used UI components such as buttons, forms, cards, and navigation bars. It is organized modularly for reusability and scalability. Our design system has the following features:",
        "item2": "Documented Components",
        "item2-1": "With Storybook, we can write clear documentation for each component, including property descriptions, usage examples, and interactive demonstrations.",
        "item3": "Consistent Design Guidelines",
        "item3-1": "The design system provides unified style guides and design specifications, ensuring a consistent appearance for components across different pages and modules.",
        "item4": "Visual Testing",
        "item4-1": "Developers can preview the appearance and behavior of components in real-time and perform visual testing and design validation through plugins.",
        "item5": "Cross-Team Collaboration",
        "item5-1": "Designers and developers can use Storybook's visual interface to discuss components, improving communication efficiency between design and development."
    },
    "mockup": { 
        "tab": {
            "item1": "Registration",
            "item2": "Home",
            "item3": "Search",
            "item4": "Course Categories",
            "item5": "Course Detail",
            "item6": "Course Enrollment",
            "item7": "Training Institute",
            "item8": "Apply Review Progress",
            "item9": "Online Consultation"
        },
        "info": {
            "item1": "Segmented Control",
            "item1-1": "Use dynamic switching to toggle between different forms, catering to different user registrations while maintaining a unified design and reducing additional development efforts.",
            "item2": "Real-time Validation",
            "item2-1": "Integrate API data to enable real-time validation, reducing manual review time.",
            "item3": "Search Function",
            "item3-1": "Place the search function in the Hero section of the homepage, allowing visitors to search for courses or providers instantly, enhancing convenience.",
            "item4": "Latest News Section",
            "item4-1": "Showcase the latest three news updates on the website.",
            "item5": "Popular Course Categories",
            "item5-1": "Categorize courses by type to help users quickly find suitable categories.",
            "item6": "Student Reviews",
            "item6-1": "Display the latest course reviews from students to provide visitors with feedback on the courses.",
            "item7": "Introduction to Taiwan's Features",
            "item7-1": "Since most visitors are international students, provide information about Taiwan (transportation, cuisine, attractions, etc.) to help them quickly understand the country.",
            "item8": "Modal popup",
            "item8-1": "With the use of popup design, users can check information at any time on the screen. We also provide popular tags and recommended courses for reference.",
            "item9": "Collapse Button", 
            "item9-1": "Click the Filter button on the left to collapse the filter, making it easier for users to browse.", 
            "item10": "Course Card", 
            "item10-1": "Courses are designed in card format, with key information displayed, allowing users to easily view required items in real time.",
            "item11": "Fixed Card", 
            "item11-1": "Fix the course information card on the right side, allowing users to click and register for the course anytime while browsing the information on the left.", 
            "item12": "Segmented Control", 
            "item12-1": "Users can instantly switch between information for easy and quick content search.",
            "item13": "Progress Bar", 
            "item13-1": "Displays the registration stage with a progress bar, dividing the steps to avoid a lengthy filling process.", 
            "item14": "Group Registration Section", 
            "item14-1": "Use the 'Add New' button to add members, and a file upload button is also provided to batch add members.",
            "item15": "Drawer Component", 
            "item15-1": "After clicking the 'Add New' button, the form will slide out from the right side, saving space on the page.",
            "item16": "Course Unit Card", 
            "item16-1": "Provides contact information and consultation button.", 
            "item17": "Segment Control", 
            "item17-1": "Users can instantly switch between information to browse the unit's introduction, courses, and transportation details.",
            "item18": "Segment Control",
            "item18-1": "Allows toggling to view courses with different registration statuses.",
            "item19": "Registered Course Card",
            "item19-1": "Presented in a card format, displaying various review statuses and action buttons.",
            "item20": "Registration Details", 
            "item20-1": "Click the registration course card to view the details.", 
            "item21": "Registration Form", 
            "item21-1": "This is a group registration demonstration, where you can check the registration review status of each member.",
            "item22": "Chat Window", 
            "item22-1": "Click the consultation button in the lower-right corner to expand the chat window. The units that have conducted the conversation will be listed for easy viewing.",
            "item23": "Real-time Chat", 
            "item23-1": "The chat window allows real-time communication with the course units and supports file uploads."
        }
    },
    "feedback": { 
        "item1": "Control of Project Timeline",
        "item1-1": "The project timeline is extremely tight, and the structure is complex. Despite the lack of clear requirements from the client, we still needed to deliver results according to the planned schedule. To address this, I broke down the functionalities and allocated time for each function, prioritizing clear requirements. For unclear requirements, I constructed a rough framework and regularly discussed and adjusted it with the PM and client. This approach avoided the time waste of a complete replan and improved efficiency.",
        "item2": "Solutions for Unclear Requirements",
        "item2-1": "Facing the challenge of unclear goals from the client and the pressure of a tight timeline, I adopted a proactive research approach: collecting a large amount of information on mature market products based on the general direction provided by the client, referencing relevant structures for preliminary planning, and then discussing optimizations with the client. This not only helped the client clarify their goals but also effectively utilized development time.",
        "item3": "Design of Innovative Features",
        "item3-1": "The project involved several innovative features that are rare in the market, targeting a relatively niche audience with limited reference materials. To address this, I referred to similar market designs and adjusted them to reduce the learning curve for users. At the same time, I developed innovative solutions tailored to the specific context of the client to meet the project’s goals.",
        "item4": "Design of Frontend and Backend Systems",
        "item4-1": "In designing the frontend and backend systems, it was necessary to balance frontend usability with backend data access efficiency. I worked closely with the PM and engineering team, engaging in multiple discussions and adjustments to ultimately find a solution that balanced both aspects, ensuring the system design met requirements while maintaining efficiency.",
        "item5": "Team Communication",
        "item5-1": "The project involved multiple stakeholders, including internal developers, the client, government authorities, end-users, and external contractors. Each team had its unique needs and constraints. I consolidated input from all parties and, after multiple rounds of coordination, made design decisions that balanced the interests of all sides, ensuring the smooth progress of the project."
    }
    
}