{
    "core":{
        "title": "Paw Cafe",
        "desc": "Find coffee shops all across Taiwan"
    },
    "info":{
        "item1": "Side Project",
        "item2": "UI / UX Designer",
        "item3": "UI Design, UX Research, Design System, Front-end Develop"
    },
    "demand": {
        "item1": "Web UI Design",
        "item2": "Registration/Login System",
        "item3": "Member Center",
        "item4": "Database Integration",
        "item5": "Shopping System",
        "item6": "Order System",
        "item7": "Wishlist Feature"
    },
    "team":{
        "item1": "UI / UX Designer",
        "item2": "Front-end Developer",
        "item3": "Back-end Developer",
        "item4": "Project Manager",
        "item5": "System Analysis"
    },
    "brief": {
        "item1": "This is a personal project designed as a practice platform for integrating databases and implementing various interactive features. The goal of this project is to simulate key functionalities in real product development, including shopping carts, product favorites, login and registration systems, allowing me to gain a comprehensive understanding of the connection between design and backend technologies.<br><br>During the project, I focused not only on designing the visual interface and user flow but also learned how to use databases for data management, enabling the storage and retrieval of user and product information.",
        "item2": "Login and Registration System",
        "item2-1": "Supports user account creation, login authentication, and data storage while ensuring system security and user data privacy.",
        "item3": "Database Integration and Management",
        "item3-1": "I used Firebase as the database, achieving seamless integration between the backend database and the frontend interface to support dynamic updates and synchronization of user information, product lists, and more.",
        "item4": "Shopping Cart Implementation",
        "item4-1": "Provides a complete shopping experience, including adding products to the cart, adjusting quantities, and removing items, ensuring a smooth and intuitive user experience.",
        "item5": "Product Favorites Feature",
        "item5-1": "Designed a favorites list that allows users to mark their preferred products for easy viewing and management at any time."
    },
    "briefCard": {
        "item1": "Focusing on practicing front-end functionality implementation, the project involves connecting to a database and simulating common e-commerce platform requirements such as shopping cart, product favorites, and login/registration functions. Through project development, it enhances front-end technical skills and strengthens the integration of UI design and functionality.",
        "item2": "In this project, I served as both a UI/UX designer and a front-end engineer. I completed the integration of café data across Taiwan, allowing users to search for cafés nationwide, and developed the membership system and shopping cart features.",
        "item3": "When practicing front-end functionality, I practiced integrating APIs for the first time. I spent more time understanding it. Integrating APIs made data interaction more complex, and I also had to ensure that the product data in the shopping cart could be updated in real time and correctly reflected on the front end.",
        "item4": "After the project was completed, I successfully developed a functional front-end application, which also enhanced my understanding of front-end technologies, adding technical value to future product development."
    },
    "background":{
        "item1": "I usually enjoy going to cafes on my days off, but finding a cafe that meets my needs often takes a lot of time. I have to open Google Maps and check each one, or look at reviews to find out if the cafe has outlets, Wi-Fi, or if there are enough seats. Based on this need, I decided to make it the goal of my project. I integrated a third-party API database to create a website focused on cafe information across Taiwan. To further practice my frontend skills, I also added e-commerce and membership system features."
    },
    "goal": { 
        "item1": "Provide coffee shop information across Taiwan", 
        "item2": "Provide user registration/login functionality", 
        "item3": "Create a shopping system", 
        "item4": "Provide product bookmarking functionality" 
    },
    "problem": {
        "item1": "Not familiar with connecting to the database system",
        "item2": "Some data in the database is inconsistent or missing"
    },
    "persona": { 
        "info": {
            "item1": "Coffee shop enthusiast",
            "item2": "Likes to stay in coffee shops on weekends",
            "item3": "Works on a computer for long hours in coffee shops"
        },
        "difficult": {
            "item1": "Spends a lot of time searching for the right coffee shop"
        },
        "insight": {
            "item1": "Provide categorized coffee shop information",
            "item2": "Display key relevant details"
        }
    },
    "process": {
        "item1": "Open-source API Data",
        "item1-1": "I utilized an open-source café data API, connected the API to the frontend, and set up a list to display data such as name, address, and ratings.",
        "item1-2": "The database did not provide photos of coffee shops. To meet the visual presentation requirements, I integrated the <strong>Unspalsh</strong> API to generate images randomly.",
        "item2": "E-commerce Database",
        "item2-1": "I used <strong>Firebase</strong> to create account management and a product database."
    },
    "flow": { 
        "item1": "<strong>Shopping Cart Checkout Process:</strong><br>After adding items to the shopping cart, you can adjust the quantity in the cart component. Clicking checkout will direct you to the checkout page to fill in the order information. Once the checkout is submitted, the order is completed."
    },
    "principle": { 
        "item1": "Simple and Intuitive Interface",
        "item1-1": "I displayed the café's information on the homepage, allowing users to intuitively view the details upon entering the website.",
        "item2": "Consistency",
        "item2-1": "I designed a consistent style for various cards, making the page look neat and clean while ensuring uniformity when integrating with the database.",
        "item3": "Hidden Design",
        "item3-1": "Detailed information is tucked into a side drawer component, revealed only when clicked, to keep the layout from becoming cluttered.",
        "item4": "Warm Style",
        "item4-1": "The website uses a warm and comfortable color palette (such as beige and dark gray) to convey a relaxing café ambiance."
    },
    "mockup": { 
        "tab": {
            "item1": "Registration",
            "item2": "Home",
            "item3": "Coffee Recipes",
            "item4": "Product Page",
            "item5": "Shopping Cart",
            "item6": "Profile",
            "item7": "My Orders",
            "item8": "Wishlist"
        },
        "info": {
            "item1": "Hidden Drawer Component",
            "item1-1": "Click the button to toggle between login and registration.",
            "item2": "Member Panel",
            "item2-1": "Displays the member center and logout button after logging in.",
            "item3": "Filter Function",
            "item3-1": "Provides a search bar and area filter for faster location queries.",
            "item4": "Hidden Drawer Component",
            "item4-1": "Displays café information with a hidden design to save space and allows quick closure to search for another café.",
            "item5": "Card Design",
            "item5-1": "Arranged in a card grid layout with recipe names and time descriptions.",
            "item6": "Dynamic Information Adjustment",
            "item6-1": "Dynamically adjusts ingredient quantities based on selected portions.",
            "item7": "Filter",
            "item7-1": "Allows filtering by product category or price sorting.",
            "item8": "Product Card",
            "item8-1": "Displays information or allows direct addition of products to the cart and wishlist.",
            "item9": "Popup Window",
            "item9-1": "Displays a popup for adding or removing from the wishlist, showing the product name and image.",
            "item10": "Product Detail Page",
            "item10-1": "Shows product details and allows adjusting quantity for cart addition.",
            "item11": "Cart Component",
            "item11-1": "Hidden design that displays after clicking 'Add to Cart,' allowing quantity adjustment or deletion.",
            "item12": "Cart Overview Section",
            "item12-1": "Allows quantity adjustment or deletion, with the total amount displayed at the bottom.",
            "item13": "Checkout Information Section",
            "item13-1": "Enter buyer information and select a payment method.",
            "item14": "Order Information",
            "item14-1": "Shows detailed order information after submission, including a randomly generated order number.",
            "item15": "Personal Information Section",
            "item15-1": "Allows editing member information and updates it in the database.",
            "item16": "Password Change Section",
            "item16-1": "Allows updating the member's password and synchronizes the changes to the database.",
            "item17": "Popup Notification",
            "item17-1": "Displays a popup notification to confirm information updates.",
            "item18": "Order Page",
            "item18-1": "Arranged in cards from newest to oldest, showing order details and purchased product information.",
            "item19": "Wishlist Page",
            "item19-1": "Arranged in a card grid; clicking the heart icon removes the item from the wishlist, with the option to view product details."
        }
    },
    "handoff": { 
        "item1": "In <strong>Figma</strong>, I demonstrated dark mode styles using the <strong>Variable</strong> feature, allowing toggling through a control panel to view the results of different color presentations. Additionally, I showcased various breakpoints for responsive web design (RWD) and how the designs appear on different devices to ensure a great user experience across all screen sizes."
    },
    "feedback": { 
        "item1": "System Design",
        "item1-1": "In this project, I completed the integration of the frontend, backend, and database, focusing on data retrieval and presentation. During the design phase, I made multiple adjustments to the user interface based on system requirements to ensure a balance between user experience and functionality.",
        "item2": "Database API Integration",
        "item2-1": "I practiced integrating third-party database APIs, learning how to efficiently retrieve data and display it on the frontend interface. Additionally, I optimized API request handling to enhance system performance.",
        "item3": "Backend Database Setup",
        "item3-1": "Using Firebase, I built a product database and a member management system with security restrictions for member passwords. For data operations, any updates made on the frontend (e.g., product inventory or member information) were synchronized in real-time with the database to ensure data consistency.",
        "item4": "Registration & Login Features",
        "item4-1": "While developing the registration feature, I designed a process where new members' data is immediately created in the database upon registration. Moreover, I ensured that updates to user information (such as passwords) were synchronized with the database, enhancing system integrity.",
        "item5": "Shopping Cart & Order Features",
        "item5-1": "The shopping cart functionality was one of the most challenging parts of this project. I implemented features for adjusting quantities and removing items from the cart, utilizing Vue Store for state management to maintain data consistency and ensure a smooth shopping cart and order processing experience."
    }
    
}