{
    "core":{
        "title": "Healthcare Academy (Back-End)",
        "desc": "Taiwan International Medical Education"
    },
    "info":{
        "item1": "Joint Commission of Taiwan",
        "item2": "UI / UX Designer",
        "item3": "UI Design, UX Research, Design System, Prototype"
    },
    "demand": {
        "item1": "Web Design",
        "item2": "Registration Review System",
        "item3": "Course Page",
        "item4": "Course Enrollment & Review System",
        "item5": "Member Center",
        "item6": "Online Chat Consultation"
    },
    "team":{
        "item1": "UI / UX Designer",
        "item2": "Front-end Developer",
        "item3": "Back-end Developer",
        "item4": "Project Manager",
        "item5": "System Analysis"
    },
    "brief": {
        "item1": "The 'Overseas Healthcare Personnel Training Platform' aims to consolidate and showcase Taiwan's training programs and achievements for overseas healthcare professionals while optimizing application and management services. This enhances Taiwan's role in global health development. To support the platform's full operation and ensure a smooth user experience, a robust backend system was developed as the core technical foundation of the platform. The system includes the following key features:",
        "item2": "Efficient Data Integration",
        "item2-1": "The backend system integrates comprehensive information about training programs, including course content, schedules, trainer profiles, and past training outcomes. This enables centralized management and ensures up-to-date information.",
        "item3": "Streamlined Application Processes",
        "item3-1": "The system automates the application process, allowing overseas healthcare professionals to easily search for, register, and apply for training programs. Features include application status tracking, document submission, and automated notifications, significantly reducing administrative workload and improving application efficiency.",
        "item4": "Trainee and Program Management",
        "item4-1": "The backend allows administrators to monitor trainee progress, manage training records, and generate relevant outcome reports, enhancing management transparency and data-driven decision-making.",
        "item5": "Promoting Global Health Collaboration",
        "item5-1": "The system supports multilingual capabilities and customizable workflows to meet the diverse needs of users from different countries and regions, further strengthening international engagement and collaboration."
    },
    "briefCard": {
        "item1": "Developed a fully functional and user-friendly backend system to support the efficient operation of the 'Overseas Healthcare Personnel Training Platform.' The system integrates training course data, streamlines application processes, and provides trainee management features.",
        "item2": "As a UI/UX designer, I was responsible for designing the backend system's interface and user experience. This included user needs analysis, interface design, and establishing a design system. I worked closely with the development team to ensure the seamless implementation and continuous optimization of the design concepts.",
        "item3": "The project faced challenges in balancing diverse user needs with the complexity of the backend system, including designing an effective information architecture to manage large volumes of course and trainee data while supporting multilingual requirements. Additionally, resource and time constraints posed pressure on the design and development timeline, requiring constant adjustments and optimizations to meet deadlines.",
        "item4": "The completion of the backend system significantly improved administrative efficiency, simplified course and trainee management processes, and reduced workload through automation. The establishment of a design system also laid a solid foundation for future platform expansion and optimization, ensuring the long-term sustainability and value of the project."
    },
    "background":{
        "item1": "This backend system serves as the core technical foundation developed to support the Health Academy Platform. It aims to integrate training program information provided by Taiwan to international healthcare professionals, enhance overall management efficiency, and simplify operational processes. Through the backend system, administrators can easily access course details, track application progress, and manage trainee data. Additionally, it supports multilingual and multicultural requirements to foster international medical collaboration."
    },
    "goal": {
        "item1": "Improve backend management efficiency and simplify operational processes",
        "item2": "Frontend website content editing",
        "item3": "Support management of course content, application progress, and trainee data"
    },
    "problem": {
        "item1": "The client was unable to provide clear requirements",
        "item2": "The project architecture was extensive",
        "item3": "The development timeline was tight"
    },
    "sa": { 
        "item1": "Understand the data management needs of the frontend", 
        "item2": "Understand the needs of system administrators and define system functions and workflows", 
        "item3": "Design a clear data structure to ensure efficient integration of course information and trainee management", 
        "item4": "Evaluate the existing technical architecture and platform scalability to ensure system stability and security"
    },
    "ta": { 
        "item1": "Ministry of Health and Welfare Administrator", 
        "item1-1": "Has the highest authority over the platform system and manages all course provider data.", 
        "item2": "Course Provider Administrator",
        "item2-1": "Can edit course pages, review registered trainees, and edit the introduction pages on the platform."
    },
    "research": {
        "item1": "How might we design an intuitive backend interface to simplify complex operations for administrators?",
        "item2": "How to create different permission-based views? (e.g., JMT, training institute)",
        "item3": "How might we create a systematic editing page?",
        "item4": "How might we automate administrative processes to reduce manual work and improve efficiency?",
        "item5": "How might we design a scalable backend system that facilitates future platform growth?"
    },
    "hypo": { 
        "item1": "Clear Navigation Structure",
        "item1-1": "Utilize multi-level design to avoid placing too many functions on a single page.",
        "item2": "Role Management System",
        "item2-1": "Set different permission scopes based on user roles (e.g., JCT or course providers) and dynamically adjust interface content.",
        "item3": "Modular Design",
        "item3-1": "Design standardized templates for different editing pages to ensure consistency.",
        "item4": "Batch Processing",
        "item4-1": "Provide batch operation options, allowing administrators to handle multiple items at once and reduce repetitive manual tasks.",
        "item5": "Real-Time Preview",
        "item5-1": "Allow administrators to preview changes during the editing process, enabling them to see the effects of their modifications immediately.",
        "item6": "System Integration",
        "item6-1": "Integrate the backend management system with other systems to automatically update data or trigger necessary actions, thereby reducing manual intervention."
    },
    "challenge": { 
        "item1": "Differentiated User Needs",
        "item1-1": "Different administrators have different work habits and requirements. Designing a universal interface may not fully meet each user's needs, especially in complex business processes.",
        "item2": "Technical Implementation Challenges",
        "item2-1": "Efficient, real-time preview features or drag-and-drop components require advanced frontend development skills, which may incur additional development costs and time, posing challenges for small teams or resource-limited companies."
    },
    "flow": { 
        "item1": "<strong>Review Group Registration Process:</strong><br>You can click to view participant information on the learner information page and perform review actions directly on the table."
    },
    "principle": { 
        "item1": "Simple and intuitive interface",
        "item1-1": "The navigation bar ensures that each functional area is clearly defined.",
        "item2": "Easy course creation and editing",
        "item2-1": "Provides an intuitive interface that allows administrators to easily add and edit course information, including course name, description, price, schedule, instructor, and course content.",
        "item3": "Course status management",
        "item3-1": "Allows administrators to set course statuses (e.g., published, unpublished, ongoing, completed) and provides automated reminders or notifications when a course is near full capacity or needs updating.",
        "item4": "Enrollment details and status tracking",
        "item4-1": "Administrators should be able to view detailed information for each enrollment (e.g., student details, enrollment time) and update enrollment statuses (e.g., pending, confirmed, canceled).",
        "item5": "Tiered permission control",
        "item5-1": "Set different levels of operation permissions based on roles (e.g., super administrator, course administrator) to prevent unauthorized personnel from modifying sensitive data."
    },
    "system": { 
        "item1": "In this project, we adopted <strong>Storybook</strong> to build and manage the design system, enabling a consistent and efficient component development process. The design system includes commonly used UI components such as buttons, forms, cards, and navigation bars. It is organized modularly for reusability and scalability. Our design system has the following features:",
        "item2": "Documented Components",
        "item2-1": "With Storybook, we can write clear documentation for each component, including property descriptions, usage examples, and interactive demonstrations.",
        "item3": "Consistent Design Guidelines",
        "item3-1": "The design system provides unified style guides and design specifications, ensuring a consistent appearance for components across different pages and modules.",
        "item4": "Visual Testing",
        "item4-1": "Developers can preview the appearance and behavior of components in real-time and perform visual testing and design validation through plugins.",
        "item5": "Cross-Team Collaboration",
        "item5-1": "Designers and developers can use Storybook's visual interface to discuss components, improving communication efficiency between design and development."
    },
    "mockup": { 
        "tab": {
            "item1": "Course List",
            "item2": "Course Registration",
            "item3": "Course Review",
            "item4": "Institute List",
            "item5": "Role Management",
            "item6": "User Management",
            "item7": "Breaking News",
            "item8": "Online Consultation"
        },
        "info": {
            "item1": "Fixed Navbar",
            "item1-1": "Displays the name of the course provider and user buttons.",
            "item2": "Sidebar",
            "item2-1": "Fixed on the left side, displays navigation buttons for all items, and uses collapsible menus for submenus.",
            "item3": "Tab Buttons",
            "item3-1": "Divides lengthy information into sections, allowing users to switch pages instantly for quick content entry.",
            "item4": "Course Registration List",
            "item4-1": "Displays all courses open for registration.",
            "item5": "Trainee Registration List",
            "item5-1": "Divided into individual and group registrations. Group registrations can expand to show a list of accompanying participants, and qualifications can be reviewed directly in the list.",
            "item6": "Review Status",
            "item6-1": "Allows viewing of the current review status of trainees for easy operations.",
            "item7": "Trainee Registration Details",
            "item7-1": "Clicking on a trainee displays a detailed registration information page.",
            "item8": "Group Registration Participants",
            "item8-1": "Displays a list of accompanying participants, with detailed information available upon clicking each person.",
            "item9": "Course Evaluation List",
            "item9-1": "Shows all courses open for registration and provides different operations based on status.",
            "item10": "Trainee Evaluation List",
            "item10-1": "Displays evaluation statuses of all trainees based on their courses.",
            "item11": "Evaluation Form",
            "item11-1": "Clicking on a trainee shows a popup window with evaluation content.",
            "item12": "Course Provider List",
            "item12-1": "Displays all course providers, with options to add, edit, or deactivate them.",
            "item13": "Edit Page",
            "item13-1": "Clicking the 'Edit' button displays detailed information about the course provider. Editable fields differ between the organizing committee and the course provider.",
            "item14": "Role List",
            "item14-1": "Displays all roles and their permissions, with options to edit or deactivate.",
            "item15": "Edit Page",
            "item15-1": "Clicking the 'Edit' button allows editing of role names and permissions.",
            "item16": "User List",
            "item16-1": "Displays all users, with options to add administrators with different permissions.",
            "item17": "Edit Page",
            "item17-1": "Clicking the 'Edit' button displays detailed user information.",
            "item18": "Latest News List",
            "item18-1": "Displays all latest news items, with options to add, edit, delete, or show publishing locations.",
            "item19": "Review Status",
            "item19-1": "Allows viewing of the current review status of the latest news items.",
            "item20": "Edit Page",
            "item20-1": "Clicking the 'Edit' button displays detailed information about the latest news item.",
            "item21": "Online Consultation",
            "item21-1": "Enables real-time responses to trainee messages, with support for sending images and documents.",
            "item22": "Trainee List",
            "item22-1": "Displays a list of all trainees who have interacted via messages, with options to search trainees or view conversation records."
        }
    },
    "handoff": { 
        "item1": "In <strong>Figma</strong>, I utilized the <strong>Variable</strong> feature to demonstrate multilingual switching, allowing the development team to clearly understand the variations in text length and interface layout across different languages. Additionally, I showcased RWD (Responsive Web Design) screens at various breakpoints and the visual effects on different devices, ensuring an optimal user experience across all screen sizes.<br><br>During the design review and handoff phase, I used <strong>Storybook</strong> as a platform for visual guidelines and component demonstrations, assisting the development team in referencing concrete design standards during implementation."
    },
    "feedback": { 
        "item1": "Core Role of Data Management",
        "item1-1": "For handling vast amounts of course and learner data, the backend system requires robust categorization, filtering, and retrieval capabilities. Through an intuitive interface, administrators can quickly locate the needed information, thereby reducing operational burdens.",
        "item2": "Streamlining Multi-Step Operations",
        "item2-1": "Backend systems often involve multi-step workflows. To simplify these processes, I adopted a wizard-style design that breaks complex operations into a series of simple steps, enhancing operational efficiency.",
        "item3": "Flexible Permission Management",
        "item3-1": "Backend systems typically face requirements for multiple roles and varying access levels. I designed a flexible permission management module, enabling the system to set different access rights based on user roles. This ensures data security without disrupting daily operations.",
        "item4": "Modular Design",
        "item4-1": "In large-scale backend systems, modular design enables rapid iteration and adjustments while minimizing the impact of requirement changes. This experience has deepened my understanding of designing modular and scalable interfaces, which not only address current needs but also leave room for future expansion.",
        "item5": "Supporting Efficient Batch Operations",
        "item5-1": "Administrators often need to handle large volumes of data. I implemented batch operation features in the backend system, such as bulk editing, deletion, or export after multi-item selection. Coupled with customizable filtering options, this makes data management more flexible and efficient."
    }
    
}