{
    "core":{
        "title": "Paw Cafe",
        "desc": "Find coffee shops all across Taiwan"
    },
    "info":{
        "item1": "Side Project",
        "item2": "UI / UX Designer",
        "item3": "UI Design, UX Research, Design System, Front-end Develop"
    },
    "demand": {
        "item1": "Web UI Design",
        "item2": "Registration/Login System",
        "item3": "Member Center",
        "item4": "Database Integration",
        "item5": "Shopping System",
        "item6": "Order System",
        "item7": "Wishlist Feature"
    },
    "team":{
        "item1": "UI / UX Designer",
        "item2": "Front-end Developer",
        "item3": "Back-end Developer",
        "item4": "Project Manager",
        "item5": "System Analysis"
    },
    "brief": {
        "item1": "This is a personal project designed as a practice platform for integrating databases and implementing various interactive features. The goal of this project is to simulate key functionalities in real product development, including shopping carts, product favorites, login and registration systems, allowing me to gain a comprehensive understanding of the connection between design and backend technologies.<br><br>During the project, I focused not only on designing the visual interface and user flow but also learned how to use databases for data management, enabling the storage and retrieval of user and product information.",
        "item2": "Login and Registration System",
        "item2-1": "Supports user account creation, login authentication, and data storage while ensuring system security and user data privacy.",
        "item3": "Database Integration and Management",
        "item3-1": "I used Firebase as the database, achieving seamless integration between the backend database and the frontend interface to support dynamic updates and synchronization of user information, product lists, and more.",
        "item4": "Shopping Cart Implementation",
        "item4-1": "Provides a complete shopping experience, including adding products to the cart, adjusting quantities, and removing items, ensuring a smooth and intuitive user experience.",
        "item5": "Product Favorites Feature",
        "item5-1": "Designed a favorites list that allows users to mark their preferred products for easy viewing and management at any time."
    },
    "briefCard": {
        "item1": "Focusing on practicing front-end functionality implementation, the project involves connecting to a database and simulating common e-commerce platform requirements such as shopping cart, product favorites, and login/registration functions. Through project development, it enhances front-end technical skills and strengthens the integration of UI design and functionality.",
        "item2": "In this project, I served as both a UI/UX designer and a front-end engineer. I completed the integration of café data across Taiwan, allowing users to search for cafés nationwide, and developed the membership system and shopping cart features.",
        "item3": "When practicing front-end functionality, I practiced integrating APIs for the first time. I spent more time understanding it. Integrating APIs made data interaction more complex, and I also had to ensure that the product data in the shopping cart could be updated in real time and correctly reflected on the front end.",
        "item4": "After the project was completed, I successfully developed a functional front-end application, which also enhanced my understanding of front-end technologies, adding technical value to future product development."
    },
    "background":{
        "item1": "I usually enjoy going to cafes on my days off, but finding a cafe that meets my needs often takes a lot of time. I have to open Google Maps and check each one, or look at reviews to find out if the cafe has outlets, Wi-Fi, or if there are enough seats. Based on this need, I decided to make it the goal of my project. I integrated a third-party API database to create a website focused on cafe information across Taiwan. To further practice my frontend skills, I also added e-commerce and membership system features."
    },
    "goal": { 
        "item1": "Provide coffee shop information across Taiwan", 
        "item2": "Provide user registration/login functionality", 
        "item3": "Create a shopping system", 
        "item4": "Provide product bookmarking functionality" 
    },
    "problem": {
        "item1": "Not familiar with connecting to the database system",
        "item2": "Some data in the database is inconsistent or missing"
    },
    "persona": { 
        "info": {
            "item1": "Coffee shop enthusiast",
            "item2": "Likes to stay in coffee shops on weekends",
            "item3": "Works on a computer for long hours in coffee shops"
        },
        "difficult": {
            "item1": "Spends a lot of time searching for the right coffee shop"
        },
        "insight": {
            "item1": "Provide categorized coffee shop information",
            "item2": "Display key relevant details"
        }
    },
    "process": {
        "item1": "Open-source API Data",
        "item1-1": "I utilized an open-source café data API, connected the API to the frontend, and set up a list to display data such as name, address, and ratings.",
        "item1-2": "The database did not provide photos of coffee shops. To meet the visual presentation requirements, I integrated the <strong>Unspalsh</strong> API to generate images randomly.",
        "item2": "E-commerce Database",
        "item2-1": "I used <strong>Firebase</strong> to create account management and a product database."
    },
    "principle": { 
        "item1": "Simple and Intuitive Interface",
        "item1-1": "I displayed the café's information on the homepage, allowing users to intuitively view the details upon entering the website.",
        "item2": "Consistency",
        "item2-1": "I designed a consistent style for various cards, making the page look neat and clean while ensuring uniformity when integrating with the database.",
        "item3": "Hidden Design",
        "item3-1": "Detailed information is tucked into a side drawer component, revealed only when clicked, to keep the layout from becoming cluttered.",
        "item4": "Warm Style",
        "item4-1": "The website uses a warm and comfortable color palette (such as beige and dark gray) to convey a relaxing café ambiance."
    },
    "mockup": { 
        "tab": {
            "item1": "Registration",
            "item2": "Home",
            "item3": "Search",
            "item4": "Course Categories",
            "item5": "Course Detail",
            "item6": "Course Enrollment",
            "item7": "Training Institute",
            "item8": "Apply Review Progress",
            "item9": "Online Consultation"
        },
        "info": {
            "item1": "Segmented Control",
            "item1-1": "Use dynamic switching to toggle between different forms, catering to different user registrations while maintaining a unified design and reducing additional development efforts.",
            "item2": "Real-time Validation",
            "item2-1": "Integrate API data to enable real-time validation, reducing manual review time.",
            "item3": "Search Function",
            "item3-1": "Place the search function in the Hero section of the homepage, allowing visitors to search for courses or providers instantly, enhancing convenience.",
            "item4": "Latest News Section",
            "item4-1": "Showcase the latest three news updates on the website.",
            "item5": "Popular Course Categories",
            "item5-1": "Categorize courses by type to help users quickly find suitable categories.",
            "item6": "Student Reviews",
            "item6-1": "Display the latest course reviews from students to provide visitors with feedback on the courses.",
            "item7": "Introduction to Taiwan's Features",
            "item7-1": "Since most visitors are international students, provide information about Taiwan (transportation, cuisine, attractions, etc.) to help them quickly understand the country.",
            "item8": "Modal popup",
            "item8-1": "With the use of popup design, users can check information at any time on the screen. We also provide popular tags and recommended courses for reference.",
            "item9": "Collapse Button", 
            "item9-1": "Click the Filter button on the left to collapse the filter, making it easier for users to browse.", 
            "item10": "Course Card", 
            "item10-1": "Courses are designed in card format, with key information displayed, allowing users to easily view required items in real time.",
            "item11": "Fixed Card", 
            "item11-1": "Fix the course information card on the right side, allowing users to click and register for the course anytime while browsing the information on the left.", 
            "item12": "Segmented Control", 
            "item12-1": "Users can instantly switch between information for easy and quick content search.",
            "item13": "Progress Bar", 
            "item13-1": "Displays the registration stage with a progress bar, dividing the steps to avoid a lengthy filling process.", 
            "item14": "Group Registration Section", 
            "item14-1": "Use the 'Add New' button to add members, and a file upload button is also provided to batch add members.",
            "item15": "Drawer Component", 
            "item15-1": "After clicking the 'Add New' button, the form will slide out from the right side, saving space on the page.",
            "item16": "Course Unit Card", 
            "item16-1": "Provides contact information and consultation button.", 
            "item17": "Segment Control", 
            "item17-1": "Users can instantly switch between information to browse the unit's introduction, courses, and transportation details.",
            "item18": "Segment Control",
            "item18-1": "Allows toggling to view courses with different registration statuses.",
            "item19": "Registered Course Card",
            "item19-1": "Presented in a card format, displaying various review statuses and action buttons.",
            "item20": "Registration Details", 
            "item20-1": "Click the registration course card to view the details.", 
            "item21": "Registration Form", 
            "item21-1": "This is a group registration demonstration, where you can check the registration review status of each member.",
            "item22": "Chat Window", 
            "item22-1": "Click the consultation button in the lower-right corner to expand the chat window. The units that have conducted the conversation will be listed for easy viewing.",
            "item23": "Real-time Chat", 
            "item23-1": "The chat window allows real-time communication with the course units and supports file uploads."
        }
    },
    "handoff": { 
        "item1": "In <strong>Figma</strong>, I demonstrated dark mode styles using the <strong>Variable</strong> feature, allowing toggling through a control panel to view the results of different color presentations. Additionally, I showcased various breakpoints for responsive web design (RWD) and how the designs appear on different devices to ensure a great user experience across all screen sizes.<br><br>During the design review and delivery phase, I used <strong>Storybook</strong> as a platform for visual guidelines and component showcases. This helped the development team reference specific design standards during implementation."
    },
    "feedback": { 
        "item1": "Project Timeline Management",
        "item1-1": "The timeline for this project was extremely tight, and its structure was highly complex. Despite the lack of clear requirements from the client, we still had to deliver results according to the predetermined schedule. To achieve this, I learned to make quick decisions and set priorities, focusing resources on the most critical features. Additionally, I developed a design system to support rapid iterations. This experience enhanced my project management and execution skills in high-pressure environments.",
        "item2": "Solutions for Unclear Requirements",
        "item2-1": "Faced with the challenge of unclear goals from the client, and under time pressure, I adopted a proactive research approach. Based on the client’s outlined direction, I gathered extensive information on mature market products and referenced similar frameworks for initial planning, then optimized the design through discussions with the client.",
        "item3": "Design of Innovative Features",
        "item3-1": "The project involved many innovative features rarely seen in the market. To ensure usability, I adjusted the design by referencing similar market functionalities, minimizing user learning curves. At the same time, I crafted innovative solutions tailored to the client’s specific context and project goals.",
        "item4": "Frontend and Backend System Design",
        "item4-1": "In designing the frontend and backend systems, it was essential to balance ease of use for frontend users with data access efficiency in the backend. I worked closely with the PM and engineering teams, engaging in multiple discussions and adjustments to develop a solution that met both needs, ensuring the system design was effective and aligned with requirements.",
        "item5": "Team Communication",
        "item5-1": "This project involved multiple stakeholders, including internal developers, the client, government authorities, end-users, and external teams. Each group had unique requirements and constraints. I consolidated feedback from all parties and made design decisions that balanced the interests of each, ensuring the project progressed smoothly."
    }
    
}