{
    "info": {
        "item1": "Hello! Nice to meet you. 👋🏻",
        "item2": "Hello, I'm Tina.",
        "item3": "I am a UI/UX designer with 3 years of industry experience and a background in Business Administration. This combination allows me to focus on integrating user experience with business value in my designs. I believe design is not just about aesthetics but also a way to solve problems, enhancing product usability and creating more value for businesses.<br><br>My background enables me to approach design from the perspective of market needs and user behavior, crafting digital products that balance functionality and appeal. Additionally, I excel at coordinating with various stakeholders in projects to ensure aligned goals and outcomes that meet market demands.<br><br>In my free time, I enjoy visiting coffee shops and attending exhibitions. These hobbies sharpen my observational skills and attention to detail, qualities that I incorporate into my design work to better meet user needs and create delightful experiences."
    },
    "value": {
        "T1": "My Values",
        "V1": "Collaboration & Communication",
        "V1-1": "As a UI/UX designer, I believe empathy and considering others' perspectives help us better understand how to collaborate with different types of people. I maintain an open mindset to communicate and exchange ideas with team members, allowing us to progress continuously together.",
        "V2": "Continuous Learning & Problem-Solving",
        "V2-1": "As a designer, I am passionate about learning, constantly refining my professional skills, and acquiring new knowledge to meet ever-changing design demands. When facing challenges, I focus on deep understanding and providing innovative solutions.",
        "V3": "Efficiency & Value Creation",
        "V3-1": "I believe that good work efficiency enhances effectiveness and drives the progress of the entire workflow. I strive to excel professionally and improve efficiency in my work, contributing to the overall value creation of the team."
    },
    "skill":{
        "T1": "I specialize in",
        "S1": "User Research",
        "S2": "UI Design",
        "S3": "Information Architecture",
        "S4": "User Flows",
        "S5": "Design Systems",
        "S6": "Interaction Design",
        "S7": "Frontend Development (Vue)",
        "S8": "Product Strategy",
        "S9": "Team Communication",
        "S10": "Project Management"
    },
    "language":{
        "T1": "I speak",
        "S1": "🇹🇼  Chinese (Mandarin)",
        "S2": "🇺🇸  English",
        "L1": "Native Speaker",
        "L2": "TOEIC Golden Certificate"
    },
    "education": {
        "T1": "Education",
        "S1": "Tamkang University",
        "L1": "Department of Business Administration - Master's",
        "L2": "📘 Thesis:《 A Study on the Impact of Third-Party Payment on Cross-Border E-Commerce Purchase Intentions 》"
    },
    "certificate":{
        "T1": "Self-Learning",
        "S1": "Google UX Design Certificate",
        "S2": "Google Cloud AI Study Jam 2024",
        "S3": "Unblock 獨角獸設計師養成計劃",
        "L1": "Native Speaker",
        "L2": "Native Speaker",
        "L3": "Native Speaker"
    },
    "tool":{
        "T1": "Tools",
        "S1": "UI/UX Design",
        "S2": "Program Development",
        "S3": "Design Tools",
        "S4": "Project Management",
        "I1": "TUniversity",
        "I2": "TUniversity"
    },
    "work":{
        "T1": "Working Experience",
        "exp1": {
            "title": "UARK Technology Co., Ltd.",
            "info": "UI/UX Designer",
            "desc": "UARK Technology Co., Ltd. focuses on developing information systems for medical, long-term care, and health industries, integrating with peripheral hardware applications.",
            "L1": {
                "title": "Responsibilities",
                "1": "Led UI design and user experience optimization for multiple products, gaining recognition from the team and users, and improving project success rates.",
                "2": "Collaborated with PMs and development teams, leading the entire design process from requirement interviews to delivering design files.",
                "3": "Built a Design System using Storybook to ensure design consistency and enhance collaboration with the development team.",
                "4": "Worked with cross-departmental teams to improve processes and user experience, reducing operational time.",
                "5": "Handled web page layout and interactive effects design, collaborating with the engineering team using Vue and integrating with Firebase databases.",
                "6": "Wrote a Medium column on UI/UX topics.",
                "7": "Developed a Figma Plugin and was invited by the Adobe team to assist in development."
            },
            "L2": {
                "title": "Projects",
                "1": "Overseas Healthcare Personnel Training Platform (Frontend)",
                "2": "Overseas Healthcare Personnel Training Platform (Backend)",
                "3": "Chiayi City Urban Backup Integration Platform",
                "4": "Taichung City Long-term Care Instant Messaging System",
                "5": "Spring Pharmacy E-commerce Website",
                "6": "Figma Plugin - Shape Mask"
            }
        },
        "exp2": {
            "title": "JING WEI Communications Co., Ltd.",
            "info": "UI/UX Designer",
            "desc": "JING WEI Communications Co., Ltd. contract project department, responsible for customized web and app development.<br>※ Reason for leaving: Department was dissolved due to business termination.",
            "L1": {
                "title": "Responsibilities",
                "1": "Implemented web layout based on designs using HTML, SCSS, Bootstrap, Tailwind, and jQuery for rapid development.",
                "2": "Established a project SCSS style library for unified adjustments and modifications.",
                "3": "Designed Design Systems and Components using Figma Library to maintain product consistency.",
                "4": "Used Git for remote updates and version control.",
                "5": "Delivered design mockups and communicated with engineers regarding technical feasibility.",
                "6": "Collaborated with business, planning, and development teams to execute projects.",
                "7": "Handled web development, design, and revisions.",
                "8": "Planned and managed project timelines and costs."
            },
            "L2": {
                "title": "Projects",
                "1": "Fengpei International Online Store",
                "2": "Moment Villa"
            }
        },
        "exp3": {
            "title": "TCA",
            "info": "Project Manager (PM)",
            "desc": "TCA specializes in organizing tech-related exhibitions and large-scale projects, such as Computex, Smart City Expo, and mobile payment industry promotion, helping to bring Taiwan's tech industry to the international stage.",
            "L1": {
                "title": "Responsibilities",
                "1": "Conducted research and surveys on the mobile payment industry.",
                "2": "Assessed project development feasibility.",
                "3": "Guided businesses in promoting the Ministry of Economic Affairs' mobile payment policies.",
                "4": "Facilitated collaboration between businesses and public sectors to promote the adoption of mobile payments across Taiwan.",
                "5": "Compiled and wrote government project proposals.",
                "6": "Communicated and provided guidance to businesses.",
                "7": "Co-planned product projects with IT service providers (collaborators include Songyan, EasyCard, JKOPay, Line Pay, etc.).",
                "8": "Mobile Payment Value-added Services/Local Promotion Project."
            },
            "L2": {
                "title": "Skills",
                "1": "Requirement Analysis",
                "2": "Project Scheduling and Management",
                "3": "Cross-department Communication",
                "4": "Merchant and Partner Guidance",
                "5": "Proposal Writing",
                "6": "Business Matching Meetings"
            }
        },
        "exp4": {
            "title": "Chung-Hua Institution for Economic Research (CIER)",
            "info": "Researcher",
            "desc": "CIER is a government-supported and industry-funded institution conducting research on domestic, international, and regional economies, providing findings to inform government policy decisions.",
            "L1": {
                "title": "Responsibilities",
                "1": "Collaborated with research teams from ITRI.",
                "2": "Studied the electric vehicle and automotive electronics markets.",
                "3": "Researched business opportunities for automotive electronics in Taiwan.",
                "4": "Collected and analyzed relevant literature.",
                "5": "Prepared research analysis reports and presentations.",
                "6": "Planned research projects.",
                "7": "Electric Vehicle Trends and Business Opportunities for Automotive Electronics Report."
            },
            "L2": {
                "title": "Skills",
                "1": "Research Project Planning",
                "2": "Market Research",
                "3": "Domestic and International Literature Review",
                "4": "Data Analysis",
                "5": "Business Framework Development",
                "6": "Research Report Writing"
            }
        }
    }
}